{"title":"Reading","clock":true,"countdown":0,"attempts":0,"intro":{"buttons":{"start":"Start"},"content":[]},"activity":{"scenes":[{"block":"scene","name":"SC1","countdown":0,"instructions":{"open":true,"content":[{"block":"group","class":"flex gap-2 items-center","content":[{"block":"audio","class":"","file":"files/inst.mp3","wave":false,"autoplay":false,"id":"","name":"r7fU"},{"block":"text","class":"","text":"Read the text and choose the most important tips to have a better job.","id":"","name":"O0iS"}]}]},"content":[{"block":"group","class":"bg-slate-100 rounded p-3 my-2 max-w-3xl mx-auto","content":[{"marker":"","class":"grid gap-4 m-5 p-5 bg-sky-200 rounded-xl shadow-xl","content":[{"block":"text","class":"text-xl font-bold","text":"Tips for finding a job","name":"3Ovd","hidden":false,"id":""},{"block":"text","class":"","text":"Finding a job can be an adventure. Some people finish college without experience, and whenever they have to look for a job, they freeze and don't know what to do. Some other people get their first job from family and friends. We are not saying this is wrong. However, if you spend more than five years of your life working with family and friends, it means you need more experience to join a larger company.<br> Well, if you are about to join the process of employment, I think that these are a few tips that can help:<br> The job of looking for a job: Believe it or not, looking for a job takes time. You should dedicate at least 4 hours a day to it. I promise it will be tiring at some point, but it is essential to be patient and kind to yourself.<br> Job portals are your friends:<br> Job portals are great tools for looking for jobs. They allow you to narrow your search to specific requirements; they can also be tailored toward your preferences until you find the perfect one. <br> Your cover letter is key:<br> In a cover letter, you can express your personality; you should introduce yourself and explain why you are the perfect candidate and why you would fit this role.<br> Learn about the companies you want to work for:<br> It is a good idea to search for information about the company you want to apply to, as you are expected to know about it in the interview. Learning about the company can significantly impact you and give you an advantage. <br> Flexibility is important:<br> If you don't get the exact position you want, there are other jobs where you can transfer your skills and increase your opportunities. You can also adapt your resume to each job offer.<br><br>  Don't worry if you don't find a job right away. You pretty much have around three months to start going to interviews and have a successful outcome. And if you ever need help, look for someone else that can take a look at your resume and cover letter. ","name":"8A2Z","hidden":false,"id":"38lYo7jy"}],"background":"","id":"fzBs","block":"group","name":"vHQV"}],"background":"","name":"4Cs6","hidden":false},{"symbol":"FinalizeGroup"}],"id":""}]},"end":{"buttons":{"restart":false},"content":[{"symbol":"finishedAll"}]},"symbols":{"finishedAll":{"class":"w-full","content":[{"block":"group","class":"bg-slate-100 rounded p-5 text-center w-full","content":[{"block":"text","text":"Congratulations, you finished the activity.","class":"","name":"Congra"}],"background":"","name":"CongraGroup"},{"block":"group","class":"text-center p-5","content":[{"block":"finished","name":"finishedBlock"}],"background":"","name":"finishedGroup"}],"background":"","block":"group"},"FinalizeGroup":{"block":"group","class":"text-center mt-10","content":[{"block":"button","class":"mx-auto","to":"/end","text":"Finalize","name":"FinalizeBTN"}],"background":""}},"metadata":{"sync":0.8219809033436813}}