{"title":"Model for Production (grammar)","clock":true,"countdown":0,"attempts":0,"intro":{"buttons":{"start":"Start"},"content":[]},"activity":{"scenes":[{"block":"scene","name":"SC1","countdown":0,"instructions":{"open":true,"content":[{"block":"group","class":"flex gap-2 items-center","content":[{"block":"audio","class":"","file":"files/inst.mp3","wave":false,"autoplay":false,"id":"","name":"C3vJ"},{"block":"text","class":"","text":"Hello dear student, read the following extract of a novel.","id":"","name":"cobi"}]}]},"content":[{"block":"group","class":"bg-slate-100 rounded p-3 my-2 max-w-3xl mx-auto","content":[{"marker":"","class":"text-lg m-2 p-4 bg-yellow-50 rounded shadow","content":[{"block":"text","class":"","text":"The Last Message<br><br> She  <b>had been waiting </b> for his message for hours. She  <b>knew</b> he was on a dangerous mission, but he  <b>had promised</b> to contact her as soon as he could. She  <b>checked</b> her phone every few minutes, hoping to see his name on the screen. But nothing  <b>came</b>. She  <b>tried</b> to distract herself with other things. She  <b>watched</b> some videos,  <b>played</b> some games, <b> read</b> some books. But nothing  <b>could</b> take her mind off him. She  <b>wondered</b> what he was doing, where he  <b>was</b>, if he  <b>was</b> okay. She  <b>prayed</b> for his safety and his return. She  <b>decided</b> to call him. Maybe he  <b>was</b> just busy and  <b>couldn’t</b> reply. Maybe  <b>he had forgotten</b> to charge his phone. Maybe he  <b>had lost</b> his signal. She  <b>dialed</b> his number and  <b>waited</b> for him to pick up. But all she  <b>heard</b> was a  <b>recorded</b> voice saying that the number  <b>was not</b> available. She  <b>felt</b> a surge of panic. Something  <b>was</b> wrong. She  <b>knew</b> it. She  <b>tried</b> to calm herself down. Maybe he  <b>had switched</b> off his phone to avoid detection. Maybe he  <b>had changed</b> his number for security reasons. Maybe he  <b>had found</b> a safe place to hide and rest. She  <b>sent</b> him a text message. She <b>told</b> him that she  <b>loved</b> him and  <b>missed</b> him. She  <b>told</b> him that she  <b>was worried</b> about him and  <b>wanted</b> to hear from him. She  <b>told</b> him that she was waiting for him and would always wait for him. She hit send and  <b>hoped</b> that he would see it. She  <b>waited</b> for his reply. She  <b>waited</b> for hours, days, weeks. But nothing came.<br> She  <b>started</b> to lose hope. She  <b>started</b> to fear the worst. She  <b>started</b> to cry every night, thinking that he was gone forever. She  <b>stopped</b> checking her phone. She  <b>stopped</b> calling him. She  <b>stopped</b> texting him. She  <b>stopped</b> waiting for him. She  <b>tried</b> to move on with her life. She  <b>tried</b> to forget him. She  <b>tried</b> to find someone else. But she  <b>couldn’t.</b><br> He  <b>was</b> still in her heart, in her mind, in her soul.<br> He  <b>was</b> still the only one she loved.<br> One day, she  <b>received</b> a notification on her phone. It was from him.<br> She  <b>couldn’t</b> believe it. She thought it was a mistake, a prank, a virus.<br> She  <b>opened</b> the message and read it.<br> It said:<br> “I love you too.”<br> It was the last message he ever sent her.<br> He  <b>had died</b> in the explosion that destroyed the enemy base.<br> He  <b>had sacrificed</b> himself to save the world.<br> He  <b>had sent</b> her the message before he died.<br> He  <b>had kept</b> his promise.<br> He  <b>had never</b> forgotten her.<br> He  <b>had always loved</b> her.<br> The End","name":"3Ovd","hidden":false,"id":""}],"background":"","id":"SkAt","block":"group","name":"Wijz"},{"marker":"","class":"grid gap-2 text-xl mt-10","content":[{"text":"Did you notice the bold letters?","class":"","id":"adjd","block":"text","name":"zVj4"},{"text":"How do this tenses help us to understand what happened first? ","class":"","id":"cn0SKg6T","block":"text","name":"IJC8"},{"text":"What tense are we using?","class":"","id":"rXRB0lDe","block":"text","name":"7vvU"},{"text":"Exactly we are using \"Past Perfect and Simple Past\"","class":"","id":"srUDvmIs","block":"text","name":"1Dtc"}],"background":"","id":"oikN","block":"group","name":"ec86"}],"background":"","name":"4Cs6","hidden":false},{"symbol":"FinalizeGroup"}],"id":""}]},"end":{"buttons":{"restart":false},"content":[{"symbol":"finishedAll"}]},"symbols":{"finishedAll":{"class":"w-full","content":[{"block":"group","class":"bg-slate-100 rounded p-5 text-center w-full","content":[{"block":"text","text":"Congratulations, you finished the activity.","class":"","name":"Congra"}],"background":"","name":"CongraGroup"},{"block":"group","class":"text-center p-5","content":[{"block":"finished","name":"finishedBlock"}],"background":"","name":"finishedGroup"}],"background":"","block":"group"},"FinalizeGroup":{"block":"group","class":"text-center mt-10","content":[{"block":"button","class":"mx-auto","to":"/end","text":"Finalize","name":"FinalizeBTN"}],"background":""}}}