{"title":"The last message","clock":true,"countdown":0,"attempts":0,"intro":{"buttons":{"start":"Start"},"content":[]},"activity":{"scenes":[{"block":"scene","name":"SC1","countdown":0,"instructions":{"open":true,"content":[{"block":"group","class":"flex gap-2 items-center","content":[{"block":"audio","class":"","file":"files/ins.mp3","wave":false,"autoplay":false,"id":"","name":"OXNu"},{"block":"text","class":"","text":"We are going to listen to a conversation, pay attention to the details. Has Emily survived to Mars? ","id":"","name":"mClj"}]}]},"content":[{"block":"group","class":"bg-slate-100 rounded p-3 my-2 max-w-3xl mx-auto","content":[{"marker":"","class":"flex justify-center","content":[{"text":"The last message<br><br>","class":"font-bold text-3xl text-center","id":"7ICd","block":"text","name":"REsA"},{"text":"Emily had always wanted to be an astronaut. Since she was a little girl, she had dreamed of exploring the stars and planets. She had studied hard, trained hard, and finally Emily got selected for the most ambitious mission for humankind: a trip to conquer Mars.<br> She knew the risks and the sacrifices. She knew she would never see her family and friends for a long time. She knew she could die alone in a barren world. But she also knew she would make history and inspire generations to come.<br> She had been on Mars for three years. She had built a habitat, planted crops, conducted experiments, and sent regular reports to Earth. She had seen dust storms, meteor showers, and sunsets. However, she had felt loneliness, boredom, and wonder.<br> She had also seen something else. Something that changed everything. Something that no one on Earth believed.<br> She had seen aliens while she worked on her chores.<br> They had appeared one day, out of the dunes. They looked like giant spiders, with eight legs and multiple eyes. They had communicated with her through telepathy, sending their ideas into her mind.<br> They had told her they were the guardians of Mars. They had told her they had watched humanity for a long time. They had told her they were not pleased with what they saw.<br> They had told her they were going to destroy Earth.<br> She had tried to reason with them, to plead with them, to warn them. But they had ignored her. They had told her it was too late. They had told her it was the only way.<br> They had given her a choice: to join them or to die with her planet. She had refused to join them. She had refused to betray her species. She had refused to give up hope.<br> She had sent one last message to Earth, telling them everything. Telling them what she saw, what she heard, what she felt. Telling them she loved them. Telling them goodbye.<br> She had hoped they would receive it in time. She had hoped they would find a way to stop them. She had hoped they would remember her.<Br> She had watched as the aliens tried to launch their attack. She had seen while the Martian laser was destroyed.<br> She saved the earth, unfortunately, she had sacrificed her life during the process.","class":"","id":"VmjbUt69","block":"text","name":"p771","hidden":true}],"background":"","id":"XvmI","block":"group","name":"8wA3"},{"marker":"","class":"flex justify-center my-2","content":[{"file":"files/img01.jpg","class":"mask mask-circle w-3/4","id":"Qa3w","block":"image","name":"7g2J"}],"background":"","id":"WKF4","block":"group","name":"WrvQ"},{"marker":"","class":"my-5","content":[{"file":"files/Listening_.mp3","wave":true,"class":"","autoplay":false,"id":"t4Vm","block":"audio","name":"nhx6"}],"background":"","id":"xZ6W","block":"group","name":"40hj"}],"background":"","name":"4Cs6","hidden":false},{"symbol":"FinalizeGroup"}],"id":""}]},"end":{"buttons":{"restart":false},"content":[{"symbol":"finishedAll"}]},"symbols":{"finishedAll":{"class":"w-full","content":[{"block":"group","class":"bg-slate-100 rounded p-5 text-center w-full","content":[{"block":"text","text":"Congratulations, you finished the activity.","class":"","name":"Congra"}],"background":"","name":"CongraGroup"},{"block":"group","class":"text-center p-5","content":[{"block":"finished","name":"finishedBlock"}],"background":"","name":"finishedGroup"}],"background":"","block":"group"},"FinalizeGroup":{"block":"group","class":"text-center mt-10","content":[{"block":"button","class":"mx-auto","to":"/end","text":"Finalize","name":"FinalizeBTN"}],"background":""}}}