{"title":"Family vacation in Puerto Vallarta","clock":false,"countdown":0,"intro":{"buttons":{"start":"Start"},"content":[]},"activity":{"scenes":[{"block":"scene","name":"SC1","countdown":0,"instructions":{"open":true,"content":[{"block":"group","class":"flex gap-2 items-center","content":[{"block":"audio","class":"","file":"instruction.mp3"},{"block":"text","class":"","text":"Christopher went on vacation to Puerta Vallarta with his family. Read the following text to know more about it.","id":"","name":"Kegb"}]}]},"content":[{"block":"group","class":"bg-slate-100 rounded p-3 my-2 max-w-5xl mx-auto","content":[{"block":"text","class":"text-2xl ","text":"During our family vacation in Puerto Vallarta, Jalisco, we immersed ourselves in the beauty and culture of the city. We brought our swimsuits and sunscreen to enjoy the beautiful beaches. My parents and uncles decided to investigate the local art scene and visited a gallery, where they admired intricate paintings and sculptures. They were captivated by the talent and creativity of the artists from Jalisco. Meanwhile, my aunts took a boat tour to see the magnificent marine life. The tour guide taught them about the diverse ecosystem and the underwater world. Meanwhile, my siblings wore snorkeling gear and dove into the crystal-clear waters. They also played beach volleyball and built sandcastles on the shore. My cousins and I wrote in our travel journals, describing the magical experiences we had. We stopped for a moment to eat. We asked locals for recommendations. They recommended a restaurant where we tasted delicious sea food and drank refreshing cocktails.  At night, my older cousins walked along the charming cobblestone streets, admiring the colonial architecture, and hearing live music. They went to some bars and discos. They talked and laughed, enjoying each other's company.  Our vacation in Puerto Vallarta was a dream that came true, filled with love, laughter, and unforgettable moments. As our vacation in this city neared its end, we knew we had to say goodbye to the picturesque beaches and the warm hospitality of the locals. However, we left with a promise to return one day, carrying the love and happiness we experienced during our time in this captivating city. Our family vacation in Puerto Vallarta was a true paradise that we will remember  forever.","name":"3Ovd","hidden":false,"id":""},{"marker":"","class":"grid grid-cols-2 gap-5 my-10","content":[{"file":"files/A1-2U6L4EA-IMG-01.jpg","class":"mask mask-squircle ","id":"TY3R","block":"image","name":"Oo9A"},{"file":"files/A1-2U6L4EA-IMG-02.jpg","class":"mask mask-squircle","id":"2bI6","block":"image","name":"B1lN"}],"background":"","id":"jqUK","block":"group","name":"QpN6"}],"background":"","name":"4Cs6","hidden":false,"marker":"","id":""},{"symbol":"FinalizeGroup"}],"id":""}]},"end":{"buttons":{"restart":false},"content":[{"symbol":"finishedAll"}]},"symbols":{"finishedAll":{"class":"w-full","content":[{"block":"group","class":"bg-slate-100 rounded p-5 text-center w-full","content":[{"block":"text","text":"Congratulations, you finished the activity.","class":"","name":"Congra"}],"background":"","name":"CongraGroup"},{"block":"group","class":"text-center p-5","content":[{"block":"finished","name":"finishedBlock"}],"background":"","name":"finishedGroup"}],"background":"","block":"group"},"FinalizeGroup":{"block":"group","class":"text-center mt-10","content":[{"block":"button","class":"mx-auto","to":"/end","text":"Finalize","name":"FinalizeBTN"}],"background":""}}}