{"title":"Reading (Text)","clock":true,"countdown":0,"attempts":0,"intro":{"buttons":{"start":"Start"},"content":[]},"activity":{"scenes":[{"block":"scene","name":"SC1","countdown":0,"instructions":{"open":true,"content":[{"block":"group","class":"flex gap-2 items-center","content":[{"block":"audio","class":"","file":"files/instruccion.mp3","wave":false,"autoplay":false,"id":"","name":"rY6a"},{"block":"text","class":"","text":"Follow me and read the next fairy tale, pay attention to the characters and their characteristics. Discuss it with your classmates.","id":"","name":"KVFF"}]}]},"content":[{"block":"group","class":"bg-slate-100 rounded p-3 my-2 max-w-3xl mx-auto","content":[{"marker":"","class":"flex justify-center my-10","content":[{"file":"files/img01.jpg","class":"mask mask-squircle w-3/4","id":"TM8b","block":"image","name":"g17i"}],"background":"","id":"mbAR","block":"group","name":"d3EW"},{"marker":"","class":"m-5 p-5 bg-amber-50 rounded-xl shadow","content":[{"block":"text","class":"font-bold text-2xl","text":"The Amazing Quest","name":"3Ovd","hidden":false,"id":""},{"marker":"","class":"mt-10","content":[{"block":"text","class":"text-xl ","text":"The wizard had always dreamed of exploring the stars. He had spent years studying the ancient scrolls and books that described the secrets of the cosmos. He had built a spaceship with the help of his loyal knight, who shared his passion for adventure. They had prepared for their quest by collecting various items and artifacts, including a magic potion that could heal any wound.<br><br>  One day, they decided to embark on their journey. They boarded the spaceship and activated the engine. The wizard used his magic to create a portal that would take them to a distant galaxy. They flew through the portal and felt a surge of excitement.<br><br>  They soon arrived at a planet that looked green and lush. They landed the spaceship and decided to explore the surface. They hoped to find some signs of life or civilization. They walked for a while until they reached a forest. They entered the forest and saw many strange plants and animals.<br><br>  Suddenly, they heard a loud roar. They turned around and saw a huge ogre charging at them. The ogre was angry and hungry. It wanted to eat them. The wizard and the knight tried to run away, but the ogre was faster. It caught up with them and swung its club at them.<br><br>  The knight blocked the club with his shield, but the impact knocked him down. The wizard cast a spell to stun the ogre, but it only made it angrier. The ogre grabbed the wizard and lifted him up. <br><br>  The knight saw this and acted quickly. He drank the magic potion and felt a surge of strength. He got up and ran towards the ogre. He smacked the ogre with his sword. It dropped the wizard and tried to grab the knight, but he dodged its attack.<br><br>  The wizard recovered from the shock and joined the fight. He cast another spell that created a blast of fire. The fire hit the ogre in the chest, making it burn. The ogre roared in agony and fell to the ground.<br><br>  The wizard and the knight looked at each other and smiled. They had defeated the ogre. They decided to leave the forest and return to their spaceship. They had enough of this planet. They wanted to see more of the universe.<br><br>  They boarded their spaceship and took off. They flew back to the portal and entered it. They wondered what other wonders and dangers awaited them in their quest.","name":"gWcj","hidden":false,"id":"fWgWiUhu"}],"background":"","id":"HA3V","block":"group","name":"mU3i"}],"background":"","id":"fFsE","block":"group","name":"gDiD"}],"background":"","name":"4Cs6","hidden":false},{"symbol":"FinalizeGroup"}],"id":""}]},"end":{"buttons":{"restart":false},"content":[{"symbol":"finishedAll"}]},"symbols":{"finishedAll":{"class":"w-full","content":[{"block":"group","class":"bg-slate-100 rounded p-5 text-center w-full","content":[{"block":"text","text":"Congratulations, you finished the activity.","class":"","name":"Congra"}],"background":"","name":"CongraGroup"},{"block":"group","class":"text-center p-5","content":[{"block":"finished","name":"finishedBlock"}],"background":"","name":"finishedGroup"}],"background":"","block":"group"},"FinalizeGroup":{"block":"group","class":"text-center mt-10","content":[{"block":"button","class":"mx-auto","to":"/end","text":"Finalize","name":"FinalizeBTN"}],"background":""}}}