{"title":"Model for Production (grammar)","clock":true,"countdown":0,"attempts":0,"intro":{"buttons":{"start":"Start"},"content":[]},"activity":{"scenes":[{"block":"scene","name":"SC1","countdown":0,"instructions":{"open":true,"content":[{"block":"group","class":"flex gap-2 items-center","content":[{"block":"audio","class":"","file":"files/inst.mp3","wave":false,"autoplay":false,"id":"","name":"C3vJ"},{"block":"text","class":"","text":"Hello dear student, read the following extract of a novel.","id":"","name":"cobi"}]}]},"content":[{"block":"group","class":"bg-slate-100 rounded p-3 my-2 max-w-3xl mx-auto","content":[{"marker":"","class":"text-lg m-2 p-4 bg-yellow-50 rounded shadow","content":[{"block":"text","class":"","text":"The Last Message<br> She had been waiting for his message for hours. She knew he was on a dangerous mission, but he had promised to contact her as soon as he could. She checked her phone every few minutes, hoping to see his name on the screen. But nothing came. She tried to distract herself with other things. She watched some videos, played some games, read some books. But nothing could take her mind off him. She wondered what he was doing, where he was, if he was okay. She prayed for his safety and his return. She decided to call him. Maybe he was just busy and couldn’t reply. Maybe he had forgotten to charge his phone. Maybe he had lost his signal. She dialed his number and waited for him to pick up. But all she heard was a recorded voice saying that the number was not available. She felt a surge of panic. Something was wrong. She knew it. She tried to calm herself down. Maybe he had switched off his phone to avoid detection. Maybe he had changed his number for security reasons. Maybe he had found a safe place to hide and rest. She sent him a text message. She told him that she loved him and missed him. She told him that she was worried about him and wanted to hear from him. She told him that she was waiting for him and would always wait for him. She hit send and hoped that he would see it. She waited for his reply. She waited for hours, days, weeks. But nothing came.<br> She started to lose hope. She started to fear the worst. She started to cry every night, thinking that he was gone forever. She stopped checking her phone. She stopped calling him. She stopped texting him. She stopped waiting for him. She tried to move on with her life. She tried to forget him. She tried to find someone else. But she couldn’t.<br> He was still in her heart, in her mind, in her soul.<br> He was still the only one she loved.<br> One day, she received a notification on her phone. It was from him.<br> She couldn’t believe it. She thought it was a mistake, a prank, a virus.<br> She opened the message and read it.<br> It said:<br> “I love you too.”<br> It was the last message he ever sent her.<br> He had died in the explosion that destroyed the enemy base.<br> He had sacrificed himself to save the world.<br> He had sent her the message before he died.<br> He had kept his promise.<br> He had never forgotten her.<br> He had always loved her.<br> The End","name":"3Ovd","hidden":false,"id":""}],"background":"","id":"SkAt","block":"group","name":"Wijz"},{"marker":"","class":"grid gap-2 text-xl mt-10","content":[{"text":"Did you notice the bold letters?","class":"","id":"adjd","block":"text","name":"zVj4"},{"text":"How do this tenses help us to understand what happened first? ","class":"","id":"cn0SKg6T","block":"text","name":"IJC8"},{"text":"What tense are we using?","class":"","id":"rXRB0lDe","block":"text","name":"7vvU"},{"text":"Exactly we are using \"Past Perfect and Simple Past\"","class":"","id":"srUDvmIs","block":"text","name":"1Dtc"}],"background":"","id":"oikN","block":"group","name":"ec86"}],"background":"","name":"4Cs6","hidden":false},{"symbol":"FinalizeGroup"}],"id":""}]},"end":{"buttons":{"restart":false},"content":[{"symbol":"finishedAll"}]},"symbols":{"finishedAll":{"class":"w-full","content":[{"block":"group","class":"bg-slate-100 rounded p-5 text-center w-full","content":[{"block":"text","text":"Congratulations, you finished the activity.","class":"","name":"Congra"}],"background":"","name":"CongraGroup"},{"block":"group","class":"text-center p-5","content":[{"block":"finished","name":"finishedBlock"}],"background":"","name":"finishedGroup"}],"background":"","block":"group"},"FinalizeGroup":{"block":"group","class":"text-center mt-10","content":[{"block":"button","class":"mx-auto","to":"/end","text":"Finalize","name":"FinalizeBTN"}],"background":""}}}