{"title":"Speaking Model (Conversation)","clock":true,"countdown":0,"attempts":0,"intro":{"buttons":{"start":"Start"},"content":[]},"activity":{"scenes":[{"block":"scene","name":"SC1","countdown":0,"instructions":{"open":true,"content":[{"block":"group","class":"flex gap-2 items-center","content":[{"block":"audio","class":"","file":"files/inst.mp3","wave":false,"autoplay":false,"id":"","name":"mVgZ"},{"block":"text","class":"","text":"Read and listen to a conversation between a teacher and his student talking about a story of Atlantis.","id":"","name":"xMXC"}]}]},"content":[{"block":"group","class":"bg-slate-100 rounded p-3 my-2 max-w-3xl mx-auto","content":[{"marker":"","class":"flex justify-center my-5 p-5","content":[{"file":"files/img01.jpg","class":"mask mask-squircle w-3/4","id":"3dSp","block":"image","name":"a1tg"}],"background":"","id":"OFbF","block":"group","name":"emE7"},{"marker":"","class":"","content":[{"file":"files/Listen.mp3","wave":true,"class":"","autoplay":false,"id":"cCyb","block":"audio","name":"D2FV"}],"background":"","id":"HFnx","block":"group","name":"AE7K"},{"marker":"","class":"","content":[{"block":"text","class":"","text":"<b>Professor:</b> Good morning, Manny. Today we are going to learn about the history of Atlantis Island, a place where magic and technology coexisted in harmony.  <br><b>Student:</b> Excuse me, dear professor. Is that the island where the legendary black knight lived?  <br><b>Professor:</b> Yes, that's correct. The black knight was one of the heroes who saved the island from the threat of their enemies, a mysterious magic force that was ruining life from the land. He also had a special mark on his hand that gave him the power to control magic.  <br><b>Student:</b> Wow, that sounds amazing. How did he get that mark?  <br><b>Professor:</b> Well, it's an old and a long story. Long time ago the black knight and his army were just mercenaries who came to Atlantis in search of work and glory. They had been through many hardships and battles together, and they dreamed of becoming the most powerful knights someday.  <br><b>Student:</b> And did they achieve their dream?  <br><b>Professor:</b> Not exactly. They got involved in a battle between humans and the Gulats, a type of race of ogres who also used magic. They also met Vania, the niece of the emperor Ibrahim, the ruler of Atlantis. She was unhappy with her arranged marriage and wanted to escape from her uncle's control. The black night fell in love with her and decided to help her.  <br><b>Student:</b> How romantic. But what about the mark?  <br><b>Professor:</b> Oh, yes. The mark appeared on the black knight’s hand when he touched a mysterious stone in the castle's dungeon. It was actually part of the ogres, which had been sealed there for hundreds of years by an ancient civilization. The mark gave the black knight the ability to gather magic around him. He had the power of healing, shielding, or controlling enemies.  <br><b>Student:</b> That sounds very useful. But why did the ogres give him that power?  <br><b>Professor:</b> No one knows for sure. Some say it was because the black knight had a pure heart and a strong will. Others say it was because he was chosen by fate to be the savior of the island. In any case, the mark also attracted the attention of many enemies, like the Yingus, the king of the Yurak, who wanted to use the ogress’s power for his own ambitions.  <br><b>Student:</b> So the black knight had to fight against him?  <br><b>Professor:</b> Yes, he did. He and his army fought bravely against the Yingus and his army, but they also faced betrayal and deception from within their own ranks. They learned that Tagren, their leader and the black knight's best warrior, had been manipulating them all along.   <br><b>Student:</b> What? That's horrible! Why did he do that?  <br><b>Professor:</b> He did it because he wanted revenge against the empire that had oppressed and exploited his people. He also wanted to create a new world where mercenaries like him could live freely and proudly. He didn't care about anyone else's feelings or wishes, not even his friends.  <br><b>Student:</b> What happened with him?  <br><b>Professor:</b> Yingus accepted his error and then he was the most loyal warrior. they had survived the war and went on with their lives. Yingus became a teacher at a magic academy and left the army to live in the magic forest. The black knight and Vania finally got married.  <br><b>Student:</b> I see. Thank you for telling me this story, professor. It was very interesting.  <br><b>Professor:</b> You're welcome, student. I hope you learned something from it.","name":"3Ovd","hidden":false,"id":""}],"background":"","id":"W8jQ","block":"group","name":"8CCh"}],"background":"","name":"4Cs6","hidden":false},{"symbol":"FinalizeGroup"}],"id":""}]},"end":{"buttons":{"restart":false},"content":[{"symbol":"finishedAll"}]},"symbols":{"finishedAll":{"class":"w-full","content":[{"block":"group","class":"bg-slate-100 rounded p-5 text-center w-full","content":[{"block":"text","text":"Congratulations, you finished the activity.","class":"","name":"Congra"}],"background":"","name":"CongraGroup"},{"block":"group","class":"text-center p-5","content":[{"block":"finished","name":"finishedBlock"}],"background":"","name":"finishedGroup"}],"background":"","block":"group"},"FinalizeGroup":{"block":"group","class":"text-center mt-10","content":[{"block":"button","class":"mx-auto","to":"/end","text":"Finalize","name":"FinalizeBTN"}],"background":""}}}