{"title":"Exercise A.Written Model Literacy","clock":true,"countdown":0,"attempts":0,"intro":{"buttons":{"start":"Start"},"content":[]},"activity":{"scenes":[{"block":"scene","name":"SC1","countdown":0,"instructions":{"open":true,"content":[{"block":"group","class":"flex gap-2 items-center","content":[{"block":"audio","class":"","file":"files/inst.mp3","wave":false,"autoplay":false,"id":"","name":"4yZ6"},{"block":"text","class":"","text":"Read the text below. Do you think this person is likely to win the lottery? Discuss it with your classmates. ","id":"","name":"YM9U"}]}]},"content":[{"block":"group","class":"bg-slate-100 rounded p-3 my-2 max-w-3xl mx-auto","content":[{"marker":"","class":"flex justify-center m-5 p-5","content":[{"file":"files/img.jpg","class":"mask mask-squircle w-3/4","id":"5EO9","block":"image","name":"VIDa"}],"background":"","id":"jaC1","block":"group","name":"wsQB"},{"marker":"","class":"grid gap-4 m-5 p-5","content":[{"block":"text","class":"text-xl","text":"If I Won The Lottery","name":"3Ovd","hidden":false,"id":""},{"text":"I can imagine what <b>my life would be like if I won the lottery.</b> Wow! I could do so many things, and my life would be so different. I would love the chance to change my life with money. The first thing I would do is change my job and run into a new business. I work in a small company where I don't receive the job benefits that I need to live, and I have always dreamed of having my own business and hiring my employees. With all that money, <b>I could give them benefits such as pension schemes, vacations, paid off time, healthcare assurance, and even a Christmas bonus!</b>  I don’t have a car right now, so I <b>would buy a new car and I would give them credits to get new cars to bring at work.</b> Or, I might even buy a new motorcycle. I like motorcycles, and I can imagine myself driving down the highway with the wind in my hair. <br> <br> Of course, <b>if I won the lottery, I would give some of the money to charity.</b> I would probably give my money to a charity that helps sick children. Also, <b>if any of my friends needed anything, I could help them pay for it.</b>  I know many people who have student loans, and I could help them pay the loans back. That would make them very happy. Plus, <b>if I won a lot of money, I would certainly save some of it invested in the bank.</b><br><br>  Also, I think that if <b>I won a huge amount of money, I would open a chain business.</b> I love to cook, and I have always wanted to open a restaurant. With all that money I could open a fancy restaurant. <br><br>  However, I know one thing I would not do is travel. I have a friend who won $100, 000 in the lottery three years ago. She took the money and traveled for three months. I think she is crazy. Traveling is nice, but then she had nothing left after her vacation.<br><br>  I think, however, that the only problem with dreaming about the money <b>I could win is that I have never even played the lottery before.</b> As they say: “You can’t win if you don’t play.”","class":"","id":"QQcA","block":"text","name":"tZYm"}],"background":"","id":"Dmsn","block":"group","name":"nQcW"}],"background":"","name":"4Cs6","hidden":false},{"symbol":"FinalizeGroup"}],"id":""}]},"end":{"buttons":{"restart":false},"content":[{"symbol":"finishedAll"}]},"symbols":{"finishedAll":{"class":"w-full","content":[{"block":"group","class":"bg-slate-100 rounded p-5 text-center w-full","content":[{"block":"text","text":"Congratulations, you finished the activity.","class":"","name":"Congra"}],"background":"","name":"CongraGroup"},{"block":"group","class":"text-center p-5","content":[{"block":"finished","name":"finishedBlock"}],"background":"","name":"finishedGroup"}],"background":"","block":"group"},"FinalizeGroup":{"block":"group","class":"text-center mt-10","content":[{"block":"button","class":"mx-auto","to":"/end","text":"Finalize","name":"FinalizeBTN"}],"background":""}}}