{"title":"Listening Comprehension","clock":true,"countdown":0,"attempts":0,"intro":{"buttons":{"start":"Start"},"content":[{"text":"Practice & Explanation-Difficult","class":"text-white my-5 text-2xl","id":"dasF","block":"text","name":"Lgi0"}]},"activity":{"scenes":[{"block":"scene","name":"SC1","countdown":0,"instructions":{"open":false,"content":[]},"content":[{"block":"group","class":"bg-slate-100 rounded p-3 my-2 max-w-3xl mx-auto border-4 border-sky-900 rounded-lg ","content":[{"block":"text","class":"","text":"En esta parte, usted escuchará preguntas o enunciados en inglés seguidos de cuatro opciones, también en inglés. Las preguntas o enunciados y las opciones se dirán solo una vez.  Escuche cuidadosamente porque solamente leerás las preguntas y respuestas  en el folleto del examen para estos ejercicios. Seleccione la mejor opción para cada pregunta o enunciado y oscurezca el espacio de la letra correspondiente en la hoja de respuestas. ","name":"tjqw","hidden":false,"id":""},{"file":"files/INS.mp3","wave":false,"class":"","autoplay":false,"id":"FUyV","block":"audio","name":"K0bn"}],"background":"","name":"Znho","hidden":false,"marker":"","id":""},{"block":"group","class":"bg-slate-100 rounded p-3 my-2 max-w-3xl mx-auto grid grid-cols-10","content":[{"marker":"","class":"col-span-8","content":[{"block":"text","class":"text-3xl font-bold","text":"Example:","name":"H2oL","hidden":false,"id":"7nqAnOsO"}],"background":"","id":"4aaO","block":"group","name":"ujkA"},{"marker":"","class":"col-span-8 bg-sky-100 rounded-lg p-1","content":[{"block":"text","class":"","text":"As we continue studying the human body, today we will examine the tooth. The hard portions of a tooth include the enamel, dentine, and cementum. The enamel is the hardest substance forming a part of the body.","name":"M7d6","hidden":false,"id":"XxZ3UFJM"}],"background":"","id":"waXK","block":"group","name":"RY0T"},{"marker":"","class":"","content":[{"file":"files/a1-example.mp3","wave":false,"class":"","autoplay":false,"id":"NPbL","block":"audio","name":"tcdl"}],"background":"","id":"q2gj","block":"group","name":"7bds"},{"marker":"","class":"col-span-8 text-xl my-5 flex items-center","content":[{"marker":"","class":"bg-slate-200 w-8 h-8 text-xl text-slate-400  rounded text-center ml-1 mr-5\n","content":[{"text":"1. ","class":"","id":"lFY1","block":"text","name":"lL8f"}],"background":"","id":"fGr5","block":"group","name":"Ggcb"},{"block":"text","class":"","text":"In what class is this lecture probably being given? ","name":"MbpE","hidden":false,"id":"XxZ3UFJMi8bf"}],"background":"","id":"oFo82g5e","block":"group","name":"oE45"},{"marker":"","class":"grid grid-cols-6 col-span-8","content":[{"marker":"","class":"col-span-5 grid grid-cols-4 my-5 gap-1","content":[{"marker":"","class":"bg-white py-2 text-center","content":[{"block":"text","class":"font-bold","text":"A) ","name":"dvWb","hidden":false,"id":"JubEZaGS"},{"block":"text","class":"","text":"History","name":"e8RX","hidden":false,"id":"WWmrknxA"}],"background":"","id":"qy0N","block":"group","name":"9cUH"},{"marker":"","class":"bg-slate-400 py-2 text-center","content":[{"block":"text","class":"font-bold","text":" B) ","name":"NCXo","hidden":false,"id":"RAqOSSga"},{"block":"text","class":"","text":"Anatomy","name":"MpwW","hidden":false,"id":"Dp2mhZ8j"}],"background":"","id":"5Ip1","block":"group","name":"SUGx"},{"marker":"","class":"bg-white py-2 text-center","content":[{"block":"text","class":"font-bold","text":" C) ","name":"AZFV","hidden":false,"id":"RBWdzbN7"},{"block":"text","class":"","text":"Literature ","name":"UVwe","hidden":false,"id":"6g0GweHE"}],"background":"","id":"L9ZYFQ6k","block":"group","name":"I4AC"},{"marker":"","class":"bg-slate-200 py-2 text-center","content":[{"block":"text","class":"font-bold","text":"D)","name":"wgQQ","hidden":false,"id":"a5Kw5Rgh"},{"block":"text","class":"","text":" Economics","name":"SneT","hidden":false,"id":"GXY50z0Q"}],"background":"","id":"Qhm1UQjO","block":"group","name":"7Vsh"}],"background":"","id":"FKJs","block":"group","name":"opop"}],"background":"","id":"GzKV","block":"group","name":"YcX1"},{"marker":"","class":"col-span-8","content":[{"text":"Respuesta correcta: B","class":"","id":"PEAX","block":"text","name":"AI1l"}],"background":"","id":"Ml1AHjzE","block":"group","name":"qk6D"}],"background":"","name":"Ccgz","hidden":false,"marker":"","id":"SbEy9tMh"},{"block":"group","class":"bg-slate-100 rounded p-3 my-2 max-w-3xl mx-auto my-10","content":[{"id":"mHe3","class":"","classitems":"","classtexts":"","classitem":"","classcounter":"","textual":"*Our schedule is from 6:00 am to 10:00 am and then from 6:00 pm to 9:00 pm. You should arrive 10 minutes before class to check in and be ready to start right on time. If you have any questions, there will be someone at the front desk.\nThis announcement will be heard on.\nA gym\nA coffee shop\nA bus\nA plane\nA\n\n*Woman: When did you go to Paris??\\nMan: A month ago… Like every year, I like to visit Paris the first month of the year.\\nWoman: Oh, that’s right! I completely forgot you love the cold weather.\nWhen did the man go to Paris? \nIn January\nIn December\nIn October\nIn February\nA\n\n*Woman: Ladies and gentlemen, all mobile phones and other electronic devices must be switched off or on flight mode before we depart. Please fasten your seat bells”\nThis announcement would be heard on. \nA train.\nA plane.\nA bus.\nA boat.\nB\n\n*Woman: I would like to have extra dressing… \\nMan: Okay, it’s a dollar fifty\\nWoman: Okay, I would also like to have extra nuts and goat cheese…\nThis conversation takes place in.\nA bar\nA gym\nA school\nA restaurant\nD\n\n*  As you already know, this style is based upon a new and innovative technologies of construction, particularly the use of glass, steel, and reinforced concrete. It emerged in the first half of the 20th century and became dominant after World War II until the 1980s. The revolution in materials came first, with the use of cast iron, drywall, plate glass and reinforced concrete…\nIn what class is this lecture probably being given?\nHistory\nLiterature\nArchitecture\nEconomics\nC\n\n*I didn’t know what to expect from him, he had been doing all these crazy comments and I was pretty upset, but it was like something inside of me wanted to tell him it was over, but at the same time, I couldn’t live without him. \nWhat is the main topic of this podcast?\nComic stories\nTraveling\nRelationships\nEconomics\nC\n\n*If you love sea animals, you should visit WildWorld in San Diego. At this place, you can swim with one of the most beautiful creatures on earth: the bottlenose dolphin. Imagine feeding a group of these playful animals’ lunch and then taking hold of their fins and swimming besides them! Lucky visitors may even get a dolphin kiss!\nThis piece of information would be given by:\nA teacher\nA travel agent\nA captain\nA soccer player\nB\n\n*Man: So, Carla, tell us about yourself.\\nWoman: I have always been interested in dancing, even as a young girl, I always kept my relatives entertained with my performances at home. My debut in the theater was when I was only fifteen years old! It was in the nutcracker! It was such a lovely experience…\nThe person who is being interviewed is:\nA professional dancer\nA makeup artist\nA painter\nAn actress\nA\n\n*Do you enjoy eating sweets every day? Do you have a hard time saying no when someone offers you a piece of cake? Do you walk into shops only to buy sweets? If you answered ‘yes’ to these questions, then you’re probably a sugar addict! Sugar addiction is a serious problem because it can cause many diseases. If you are someone who can’t resist sugary foods, it’s important to act now! Spend some time on the internet to learn about the types of food that are full of sugar!\nWhat’s the speaker’s purpose?\nTo inform\nTo entertain\nTo Persuade\nTo express feelings\nC\n\n*Man: How can I help you?\\nWoman: I’ll take a steak and a salad to go. \\nMan: Anything to drink?\\nWoman: Two sodas, please.\nWhere are they?\nAt home\nAt work\nIn a restaurant\nAt the supermarket\nC\n\n*Woman: Did I miss anything?\\nMan: Just the opening band\\nWoman: Were they good?\\nMan: Not bad, not great… It was okay. I think it was their first gig.\nWhere does this conversation take place?\nAt the theater\nAt a concert\nIn a restaurant\nA comedy club\nB\n\n*Woman 1: I just finished it!\\nWoman 2: How was it?\\nWoman: It was an interesting novel, the characters were complicated, but I loved every description.\nWhat are they talking about?\nA book\nA soap opera\nA movie\nA dish\nA\n\n*If you are seated next to an emergency exit, please read the special-instructions cad located by your seat very carefully. If you think that, in case of an emergency, you may not be able to perform that functions described, please tell a flight attendant.\nWhere does this announcement take place?\nAt the airport\nOn a plane\nOn a boat\nAt the bus station\nB\n\n*Man: Charlotte made a big mistake this time.\\nWoman: Yes, she forgot to submit her homework. \\nMan: It was the first time she made a mistake.\nWhat does the woman say about Charlotte?\nIt was the first time she made a mistake.\nShe forgot to submit her homework.\nShe sent the paper to the wrong email address.\nShe always makes mistakes.\nB\n\n*Man: Can you tell me if today’s premiere is a comedy, romance or western?\\nWoman: I have no idea.\nWhat does the woman say?\nShe has a strong opinion about movies.\nShe prefers comedies over westerns and romances.\nShe doesn’t like today’s premiere.\nShe does not know.\nD\n\n*Woman: You just got back from your job interview! How was it?\\nMan: I think there is no chance I’ll get that job.\nWhat does the man say?\nIt’s unlikely that he’ll go to an interview.\nHe thinks he’ll be recommended for another job.\nThe interview was unsuccessful.\nHe had an excellent interview.\nC\n\n*Man: I’m in a hurry, I must have my suitcase ready, I can’t find my passport… \\nWoman: I think you left it in your office. But I’m not sure.\nWhat does the woman mean?\nHe must go to the airport right now.\nHe will lose his flight.\nHis passport is not ready.\nHis passport could be at the office.\nD\n\n*Woman: I just finish History class… It felt like a 5-hour session. \\nMan: It was long, but I found it interesting, I learned so much!\nWhat does the man think about the class?\nIt was very long.\nHe liked it because he learned a lot.\nHe felt it longer than expected.\nIt was like 5 hours.\nB\n\n*Now, we are still waiting for the lab results. You may have acute gastroenteritis. It is recommended to take Omeprazole tablets, but the most important thing to keep in mind is to maintain a healthy diet.\nWhere does this conversation take place?\nAt the doctor’s office\nAt the hospital\nAt a school\nAt a restaurant\nB\n\n*We must learn about primary colors and how to mix them. There are three primary colors: Blue, red and yellow, if we mix blue and red, we will get violet or purple. \nIn what class is this lecture probably being given?\nHistory\nGeography\nEnglish\nArts\nD\n\n*Woman: So, how are you doing today?\\nMan: I’m doing a bit better, thanks, my throat was so bad I couldn’t speak for two days!\\nWoman: Oh yes, I remember, you were doing sign language! But hey, it’s Wednesday already, we are halfway there!\nWhat was wrong with the man?\nHe communicated in sign language.\nHe had a sore throat. \nHe had a cold.\nHe wanted the week to finish.\nB\n\n*Woman: I’m starving, I just worked out for three hours and I could eat a cow!\\nMan: So, what do you want to eat?\\nWoman: I don’t know, I would like a cheesecake, some cookies, pancakes, or pizza… I’ll go for the salty option.\nWhat does the woman want to eat?\nPizza\nCheesecake\nCookies\nPancakes\nA\n\n*This infection is an abscess at the root of a tooth. It needs to be removed urgently as it’s dangerous to have one tooth like this. It can hurt your heart.\nWho is the person that says this?\nA nurse\nA doctor\nA dentist\nA cook\nC\n\n*Woman: That series was so bad, I hated it…\\nMan: But you watched all the seasons! Why would you do that? The plot was so boring and repetitive. \\nWoman: Yes, the plot was boring, but the cast was so good!\nWhy did the woman keep watching that series?\nBecause the plot was boring\nBecause she watched all the seasons\nThe cast was boring.\nThe cast was really good\nD\n\n*I just finished the report, I called all the clients and changed your appointments to clear your schedule. You have a late meeting with Mr. Robinson and after that, I’ll bring your dry cleaning at home Mr. Jacobs.\nWho is saying this?\nMr. Jacobs\nMr. Robinson’s assistant\nMr. Jacobs’ assistant\nMr. Robinson\nC\n\n*Pink is the new black! Pink is everywhere, it’s the new trend. We can see it’s this season’s color. You can notice how different fabrics look on pink and they all look beautiful. You can see it on hats, shoes, handbags. \nWhat is the woman talking about?\nTrends\nSeason trends.\nTrending colors\nPink is the color of the season.\nD\n\n*Woman: I love that hat! Where did you get it?\\nMan: I don’t remember, but I guess you can find it online.\\nWoman: It’s so good for trips like this, there is no shade around the area, and you walk a lot! The only problem is the wind, sometimes it blows so hard my hat ends up covered in sand.\nWhere are they?\nAt the beach\nIn the forest\nIn the jungle\nIn the city\nA\n\n*I loved that new single, she is such a great performer, I mean, her albums are good, but her concerts are even better. Last time she was in NY, her tickets sold out in 40 seconds! Her clothes are amazing but what I like the most is the way she writes songs… \nWhat does she like best about the artist?\nHer clothes\nThat her concert tickets sold out in 40 seconds.\nHer writing\nHer concerts\nC\n\n*Woman: I just came back from the bank and they haven’t solved my problem.\\nMan: What problem? The one about those extra charges on your credit card?\nWhat does the woman say about her problem?\nThe problem is unsolved.\nShe had a problem at the bank,\nThere were extra charges on her credit card.\nThe problem was solved.\nA\n\n*Good morning, everyone, welcome to your class. You should know that it is important you attend 90% of the sessions to pass the course. Homework is mandatory, but there is always room for negotiation and late submissions.\nWhere would you hear this?\nAt the hospital\nAt the library\nAt school\nAt the gym\nC\n\n","counter":1,"evaluation":"","block":"elashq","name":"131u","audiofiles":"files/a1.mp3","hidetext":true}],"background":"","name":"Bfp0","hidden":false,"marker":"","id":"4LryNBq9"},{"symbol":"FinalizeGroup"}],"id":""}]},"end":{"buttons":{"restart":false},"content":[{"symbol":"finishedAll"}]},"symbols":{"finishedAll":{"class":"w-full","content":[{"block":"group","class":"bg-slate-100 rounded p-5 text-center w-full","content":[{"block":"text","text":"Congratulations, you finished the activity.","class":"","name":"Congra"}],"background":"","name":"CongraGroup"},{"block":"group","class":"text-center p-5","content":[{"block":"finished","name":"finishedBlock"}],"background":"","name":"finishedGroup"}],"background":"","block":"group"},"FinalizeGroup":{"block":"group","class":"text-center mt-10","content":[{"block":"button","class":"mx-auto","to":"/end","text":"Finalize","name":"FinalizeBTN"}],"background":""}}}